---
kind: property
id: P:Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.IsValidObject
source: html/d5e55a5e-7ced-d29d-5801-2fa7317fb055.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.